b = int(input('Введите первый член геом. прогрессии:')) #первый член геометрической прогрессии
q = int(input('Введите множитель прогрессии ')) #множитель прогрессии
n = int(input('Введите номер последнего элемента ')) #Введите номер последнего элемента
i= 0
summa = 0 #заданная сумма прогрессии 
while i < n : # это цикл , который считающий сумму геометрической прогрессии
    summa += b  # элемент заносим прибавляя к искомой сумме 
    b *= q   #считаем элемент через шаг прогрессии
    i += 1 #считаем шаги цикла
print(f'Ваш результат геометрической суммы {summa}')  #результат геометрической суммы 