n = int(input('Введите число :'))# Ввод проверяемого числа 
if n==2:  #Случай для 2-ки 
    print('Это число простое') 
if n == 3: #случай для 3-ки 
    print(' Это число простое')
else: 
    if n % 2 != 0: # проверяем простое число либо нет
        for divider in range(2, int( n**0.5)+1): # берем числа до квадратнгого корня самого числа 
            if n% divider == 0: # берем все числа без остатка и число непростое 
                print(' Это число простое')
                break
            else:            
                print('Это число простое') # Число простое в противном 
                break
    else: 
        print(' Это число не простое')